qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
#define UUID16_EXTRACT(DST,SRC)                                                                  \
        do                                                                                       \
        {                                                                                        \
            (*(DST)) = (SRC)[1];                                                                 \
            (*(DST)) <<= 8;                                                                      \
            (*(DST)) |= (SRC)[0];                                                                \
        } while(0)

typedef struct {
    uint8_t *p_data;
    uint16_t data_len;
} data_t;

static ble_led_t m_led;
static ble_iqo_t m_iqo;
static ble_memdump_t m_memdump;
static ble_gap_scan_params_t m_scan_param;
uint8_t led_uuid_type = 0;

uint16_t error_cnt = 0;
uint32_t last_error_code = 0;
uint8_t *last_error_file_name = NULL;
uint8_t flash_write_w_backup_status = 0;
uint8_t flash_write_w_backup_data[24];

extern ble_iqo_id_t iqo_tgt_identify;

static const ble_gap_conn_params_t m_connection_param =
{
    (uint16_t)PERIPHERAL_AND_MIN_CONN_INTERVAL,     // Minimum connection
    (uint16_t)PERIPHERAL_AND_MAX_CONN_INTERVAL,     // Maximum connection
    (uint16_t)PERIPHERAL_AND_SLAVE_LATENCY,         // Slave latency
    (uint16_t)PERIPHERAL_AND_CONN_SUP_TIMEOUT       // Supervision time-out
};

/*****************************************************************************
* Functions and structures related to connection and buffers
*****************************************************************************/
#define DATA_BUFFER_SIZE                   12 /* Size of bufer that collects HTS data from one peripheral. */

#define TX_BUFFER_READY                    1 /* TX buffer empty. */
#define TX_BUFFER_BUSY                     0 /* TX buffer in use. */                               

static uint8_t gs_tx_buffer = TX_BUFFER_READY;

typedef struct {
    uint8_t next_entry_index;
    uint8_t value[DATA_BUFFER_SIZE];
} data_buffer_t;

typedef struct {
    uint16_t                conn_handle;
    uint16_t                descriptor_handle;
    data_buffer_t           data_buffer;
    ble_db_discovery_t      db_discovery;
    ble_iqo_c_t             iqo_c;
} peripheral_t;

peripheral_t gs_peripheral[NUMBER_OF_PERIPHERALS];

typedef struct
{
    uint16_t conn_handle;
    uint8_t  notification_enabled;
    uint8_t  cpu_request_done;
} central_t;

central_t gs_central;
static bool gs_advertising_is_running = false;

// All flash log operations shall happen in scheduler context
static void app_log_error(void * p_event_data , uint16_t event_size)
{
	uint32_t *ptr;

    ptr = (uint32_t *)p_event_data;
	persistent_record_error((uint8_t)ptr[0], ptr[1]);
}

// Application error handler
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    static uint32_t error_buf[2];

	error_cnt++;
	last_error_code = error_code;
	last_error_file_name = (uint8_t *)p_file_name;

	if ((uint8_t)error_code >= PERSISTENT_ERROR_SYS_MAX) {
		error_buf[0] = PERSISTENT_ERROR_SYS_MAX;
	} else {
		error_buf[0] = (uint8_t)error_code;
	}
	error_buf[1] = (line_num & 0x0000FFFF) | (((uint32_t)p_file_name & 0x0000FFFF) << 16);

	app_sched_event_put((void *)&(error_buf[0]), 8, app_log_error);
}

// SoftDevice
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    persistent_record_error(PERSISTENT_ERROR_DEADBEEF, (uint32_t)line_num);
	for(;;);
}

// Start scan for device
void scan_start(void)
{
    m_scan_param.active = 0;
    m_scan_param.selective = 0;
    m_scan_param.interval = SCAN_INTERVAL;
    m_scan_param.window = SCAN_WINDOW;
    m_scan_param.p_whitelist = NULL;
    m_scan_param.timeout = 0x0000;

    APP_ERROR_CHECK(sd_ble_gap_scan_start(&m_scan_param));
}

#define INVALID_DESCRIPTOR_HANDLE 0
#define ID_NOT_FOUND 0xFFFF

// Reset information about peer central
static void central_info_reset(void)
{
    memset((void*)&gs_central, 0, sizeof(central_t));
    gs_central.conn_handle = BLE_CONN_HANDLE_INVALID;
    gs_central.notification_enabled = 0;
    gs_central.cpu_request_done  = 0;
    gs_tx_buffer = TX_BUFFER_READY;
}

static void peripheral_info_reset(uint16_t peripheral_id)
{
    if (peripheral_id < NUMBER_OF_PERIPHERALS) {
        memset((void*)&(gs_peripheral[peripheral_id]), 0, sizeof(peripheral_t));
        gs_peripheral[peripheral_id].conn_handle = BLE_CONN_HANDLE_INVALID;
        gs_peripheral[peripheral_id].descriptor_handle = INVALID_DESCRIPTOR_HANDLE;
    }
}

/**@brief Function resets structure that keep information about peer peripherals.
*/
static void peripherals_info_reset(void)
{
    uint16_t peripheral_id = ID_NOT_FOUND;
    
    for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++) {
        peripheral_info_reset(peripheral_id);
    }
}

// Query peripheral ID
static uint16_t peripheral_id_get(uint16_t conn_handle)
{
    uint8_t i = 0;
    
    for (i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (conn_handle == gs_peripheral[i].conn_handle) {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

// Get available peripheral ID
static uint16_t peripheral_get_available_id(void)
{
    for (uint8_t i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (gs_peripheral[i].conn_handle == BLE_CONN_HANDLE_INVALID) {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

ble_iqo_c_t *peripheral_get_iqo_c(uint16_t conn_handle)
{
    for (uint8_t i = 0; i < NUMBER_OF_PERIPHERALS; i++) {
        if (gs_peripheral[i].conn_handle == conn_handle) {
            return &(gs_peripheral[i].iqo_c);
        }
    }
    return NULL;
}

bool is_central(uint16_t conn_handle)
{
    if (conn_handle == gs_central.conn_handle)
    {
        return true;
    }
    else
    {
        return false;
    }
}

/*****************************************************************************
* GAP events handling
*****************************************************************************/

/**@brief Function that handles BLE connect event for peer Central
 *
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static void connect_peer_central(ble_evt_t *p_ble_evt)
{
    if (gs_central.conn_handle == BLE_CONN_HANDLE_INVALID) {
        gs_central.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        gs_advertising_is_running = false;
    }
}

/*****************************************************************************
* Functions related to service setup, advertisement, discovery, device connection
*****************************************************************************/
/**@brief Function steup own service to be used to notify average values to peer central.
 *
 * Function does not return error code. If any internal call failes it triggers APP_ASSERT.
*/
static void services_init(void)
{
    APP_ERROR_CHECK(ble_iqo_init(&m_iqo));
    APP_ERROR_CHECK(ble_memdump_init(&m_memdump));
    APP_ERROR_CHECK(ble_led_init(&m_led));
}

