qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
// Initialize timer module
static void timers_init(void)
{
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, false);
}

static uint32_t adv_report_parse(uint8_t type, data_t * p_advdata, data_t * p_typedata)
{
    uint32_t index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len) {
        uint8_t field_length = p_data[index];
        uint8_t field_type = p_data[index+1];

        if (field_type == type) {
            p_typedata->p_data = &p_data[index+2];
            p_typedata->data_len = field_length-1;
            return NRF_SUCCESS;
        }
        index += field_length+1;
    }
    return NRF_ERROR_NOT_FOUND;
}

static void iqo_c_evt_handler(ble_iqo_c_t * p_iqo_c, ble_iqo_c_evt_t * p_iqo_c_evt)
{
    switch (p_iqo_c_evt->evt_type) {
        case BLE_IQO_C_EVT_DISCOVERY_TEMP_COMPLETE:
            APP_ERROR_CHECK(ble_iqo_c_temp_enable(p_iqo_c));
            break;

        case BLE_IQO_C_EVT_IT_NOTIFY:
            //FIXME
            break;

        case BLE_IQO_C_EVT_DISCOVERY_ACC_COMPLETE:
            APP_ERROR_CHECK(ble_iqo_c_acc_enable(p_iqo_c));
            break;

        case BLE_IQO_C_EVT_ACC_NOTIFY:
            //FIXME
            break;

        default:
            break;
    }
}

static void iqo_c_init(uint16_t conn_handle)
{
    ble_iqo_c_init_t iqo_c_init_obj;
    uint16_t peripheral_id = peripheral_id_get(conn_handle);

    iqo_c_init_obj.evt_handler = iqo_c_evt_handler;

    uint32_t err_code = ble_iqo_c_init(conn_handle, 
                                        (peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].iqo_c), 
                                        &iqo_c_init_obj);
    APP_ERROR_CHECK(err_code);
}

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    data_t adv_data;
    data_t type_data;
    uint32_t err_code = NRF_SUCCESS;
    const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_SCAN_REQ_REPORT:

            break;

        case BLE_GAP_EVT_ADV_REPORT:
            // Initialize advertisement report for parsing.
            adv_data.p_data = (uint8_t *)p_gap_evt->params.adv_report.data;
            adv_data.data_len = p_gap_evt->params.adv_report.dlen;

            err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                        &adv_data,
                                        &type_data);
            if (err_code != NRF_SUCCESS) {
                // Compare short local name in case complete name does not match.
                err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                            &adv_data,
                                            &type_data);
            }

            // Verify if short or complete name matches target.
            if (err_code == NRF_SUCCESS) {
                uint16_t extracted_uuid;

                // UUIDs found, look for matching UUID
                for (uint32_t u_index = 0; u_index < (type_data.data_len/UUID16_SIZE); u_index++) {
                    UUID16_EXTRACT(&extracted_uuid,&type_data.p_data[u_index * UUID16_SIZE]);

                    if(extracted_uuid == TARGET_UUID) {
                        // Stop scanning.
                        APP_ERROR_CHECK(sd_ble_gap_scan_stop());
                        
                        // Initiate connection.
                        APP_ERROR_CHECK(sd_ble_gap_connect(&p_gap_evt->params.adv_report.peer_addr,
                                                       &m_scan_param,
                                                       &m_connection_param));
                        break;
                    }
                }
            }
            break;

        case BLE_GAP_EVT_CONNECTED:
            if (p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) {
                // Peer is central, we are peripheral
                connect_peer_central(p_ble_evt);
            } else {
                // Connected to peer peripheral
                uint16_t next_id = 0;

                next_id = peripheral_get_available_id();
                if (next_id != ID_NOT_FOUND) {
                    gs_peripheral[next_id].conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                }

                // Initialize collector
                iqo_c_init(p_ble_evt->evt.gap_evt.conn_handle);
            }
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            if (is_central(p_ble_evt->evt.gap_evt.conn_handle)) {
                // Disconnected with peer central
                // Check p_ble_evt->evt.gap_evt.params.disconnected.reason ??
                central_info_reset();
                advertising_start();
            } else {
                // Try reconnect ???
            }
            break;

        case BLE_GAP_EVT_TIMEOUT:
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        	sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0);
        	break;

        default:
            // No implementation needed.
            break;
    }
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    uint16_t peripheral_id;

    on_ble_evt(p_ble_evt);
    peripheral_id = peripheral_id_get(p_ble_evt->evt.common_evt.conn_handle);
    ble_db_discovery_on_ble_evt((peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].db_discovery), p_ble_evt);
	ble_memdump_on_ble_evt(&m_memdump, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_iqo_c_on_ble_evt((peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].iqo_c), p_ble_evt);
    ble_led_on_ble_evt(&m_led, p_ble_evt);
    ble_iqo_on_ble_evt(&m_iqo, p_ble_evt);
}

static void check_flash_status(void * p_event_data , uint16_t event_size)
{
	uint32_t event;

	event = *(uint32_t *)p_event_data;
    flash_helper_sys_event(event);
}

static void on_sys_evt(uint32_t sys_evt)
{
	static uint32_t evt= 0;

	evt = sys_evt;
    switch(sys_evt) {
    	case NRF_EVT_FLASH_OPERATION_SUCCESS:
    	case NRF_EVT_FLASH_OPERATION_ERROR:
    	    APP_ERROR_CHECK(app_sched_event_put((void *)&evt, sizeof(evt), check_flash_status));
    		break;

        default:
            break;
    }
}

static void sys_evt_dispatch(uint32_t sys_evt)
{
    on_sys_evt(sys_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_RC_250_PPM_8000MS_CALIBRATION, false);

