qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
    // Enable BLE stack
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    APP_ERROR_CHECK(sd_ble_enable(&ble_enable_params));

    // Register with the SoftDevice handler module for BLE events.
    APP_ERROR_CHECK(softdevice_ble_evt_handler_set(ble_evt_dispatch));

    // Register with the SoftDevice handler module for BLE events.
    APP_ERROR_CHECK(softdevice_sys_evt_handler_set(sys_evt_dispatch));
}

static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

static void gap_params_init(void)
{
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
    uint8_t					dev_name[21];

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    persistent_get_dev_name(dev_name);
    APP_ERROR_CHECK(sd_ble_gap_device_name_set(&sec_mode,
            		(const uint8_t *)dev_name,
            		strlen((char *)dev_name)));

    APP_ERROR_CHECK(sd_ble_gap_appearance_set(BLE_APPEARANCE_UNKNOWN));

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = PERIPHERAL_AND_MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = PERIPHERAL_AND_MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = PERIPHERAL_AND_SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = PERIPHERAL_AND_CONN_SUP_TIMEOUT;

    APP_ERROR_CHECK(sd_ble_gap_ppcp_set(&gap_conn_params));
}

static void advertising_init(void)
{
    ble_advdata_t advdata;      // flag, appearance, service
    ble_advdata_t srdata;       // full device name
    uint8_t       flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    // FIXME: battery service is the place holder for Smart Lamp
    ble_uuid_t adv_uuids[] = {{BLE_UUID_LED_SERVICE, led_uuid_type}};

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_NO_NAME;
    advdata.include_appearance      = true;
    advdata.flags.size              = sizeof(flags);
    advdata.flags.p_data            = &flags;
    advdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = adv_uuids;

    // Build and set scan response data
    memset(&srdata, 0, sizeof(srdata));
    srdata.name_type                = BLE_ADVDATA_FULL_NAME;

    APP_ERROR_CHECK(ble_advdata_set(&advdata, &srdata));
}

static void advertising_start(void)
{
    ble_gap_adv_params_t adv_params;

    // Start advertising
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    APP_ERROR_CHECK(sd_ble_gap_adv_start(&adv_params));
}

static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
        LOG_INFO("parameter negotiation failed\n");
    } else if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_SUCCEEDED) {
        LOG_INFO("parameter negotiation success!\n");
    }
}

static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void conn_params_init(void)
{
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = PERIPHERAL_FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = PERIPHERAL_NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = PERIPHERAL_MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    cp_init.secondary_min_conn_interval = PERIPHERAL_IOS_MIN_CONN_INTERVAL;
    cp_init.secondary_max_conn_interval = PERIPHERAL_IOS_MAX_CONN_INTERVAL;
    cp_init.secondary_slave_latency     = PERIPHERAL_IOS_SLAVE_LATENCY;
    cp_init.secondary_conn_sup_timeout  = PERIPHERAL_IOS_CONN_SUP_TIMEOUT;

    APP_ERROR_CHECK(ble_conn_params_init(&cp_init));
}

static void db_discovery_init(void)
{
    APP_ERROR_CHECK(ble_db_discovery_init());
}

void intermcu_spi_cb(uint8_t type, uint8_t len, uint8_t *buf)
{
    // FIXME: inter-MCU communication
}

void protect_flash(void)
{
	APP_ERROR_CHECK(sd_flash_protect(0, 0xFF800000));
}

static void wdt_init(void)
{
	NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);
	NRF_WDT->CRV = 2*32768;   // 2 seconds timeout period
	NRF_WDT->RREN |= WDT_RREN_RR0_Msk;  //Enable reload register 0
	NRF_WDT->TASKS_START = 1;
}

/* Initial configuration of peripherals and hardware before the test begins. Calling the main loop. */
int main(void)
{
	/////////////////////////////////////////////////////
	//          P r o t e c t    F l a s h             //
	/////////////////////////////////////////////////////
	protect_flash();
	persistent_init();		// Persistent storage shall be initialized before radio is turned on

    ////////////////////////////////////////////////////
	//      I n i t i a l i z e    S y s t e m        //
	////////////////////////////////////////////////////
	wdt_init();
    timers_init();
    intermcu_init(intermcu_spi_cb);
    ble_stack_init();
    scheduler_init();
    ble_radio_notification_init(APP_IRQ_PRIORITY_LOW, 0, flash_radio_notification_evt_handler_t);

    ////////////////////////////////////////////////////
    //      I n i t i a l i z e    S e r v i c e      //
    ////////////////////////////////////////////////////
    // Initialize external RTC
    led_service_init();
    APP_ERROR_CHECK(sd_ble_gap_tx_power_set(4));

    /////////////////////////////////////////////////////
    //  I n i t i a l i z e    B L E   S e r v i c e   //
    /////////////////////////////////////////////////////
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    db_discovery_init();
    peripherals_info_reset();
    central_info_reset();

    // Finally start advertise
    advertising_start();

    for (;;) {
        app_sched_execute();
    }
}


